---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.UseAnnotationScaleForSingleLineFittings
source: html/ca019bfb-0ff9-8e14-9848-797bd3fcdd9a.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.UseAnnotationScaleForSingleLineFittings Property

Indicates whether use annotation scale for single line fittings or not.

## Syntax (C#)
```csharp
public bool UseAnnotationScaleForSingleLineFittings { get; set; }
```